# данные прописаные в коде, называются литералами
print("Hello World!!") #строковые литералы, выделяются ' "
#тип данных- вид информации с которой мы работаем
print(42) #целочисленый литерал
print(3.14)#вещественный литерал
#Типы данных в питоне
#str-строковый тип
#int-целочисленный тип (3)
#float-вещественный тип (3.0)

#подпрограмма(функция или процедура)- это независимый кусок кода, выполняющая определенную задачу, пригодный для
#многоразового использования

#функция характеризуется тем, какая информация ей нужна для работы (аргументы), и что является результатом ее работы
# если подпрограмма ВОЗВРАЩАЕТ некоторое значение (результат ее работы) то ее принято называть ФУНКЦИЯ
#если подпрограмма только выполняет некоторые действия, и не возвращает никакго результата, то ее принято
#называть ПРОЦЕДУРОЙ

name = input()
print(name)

#для разных типов данных доступные разные операция(действия)